"""
Написати функцію для перевірки правильності введеної дати. 
Функція приймає 3 аргументи - день, місяць та рік і повертає True, 
якщо така дата є в календарі, і False в протилежному випадку.

Вхідні дані:
04
03
2029
33
11
2019

Вихідні дані:
True
False

||| курс, Бритвич Олександр Володимирович (ПІБ)
"""


# Функція для перевірки коректності введених значень дня, місяця та року
def is_valid_date(func_day, func_month, func_year):
    # Перевірка на коректність значень дня, місяця та року
    if not (1 <= func_day <= 31 and 1 <= func_month <= 12 and 1000 <= func_year <= 3000):
        return False

    # Перевірка на коректність днів у місяці
    days_in_month = {
        1: 31, 2: 29 if (func_year % 4 == 0 and func_year % 100 != 0) or (func_year % 400 == 0) else 28,
        3: 31, 4: 30, 5: 31, 6: 30, 7: 31, 8: 31, 9: 30, 10: 31, 11: 30, 12: 31
    }

    if not (1 <= func_day <= days_in_month[func_month]):
        return False

    return True


# Безкінечний цикл для введення дати користувачем
while True:
    # Зчитування значень дня, місяця та року з консолі
    day = int(input("Введіть день: "))
    month = int(input("Введіть місяць: "))
    year = int(input("Введіть рік: "))

    # Перевірка введеної дати за допомогою функції is_valid_date
    if is_valid_date(day, month, year):
        print("Введена дата є коректною. Для закінчення введіть всюди 0.")
    # Введено всюди 0, завершення програми
    elif day == month == year == 0:
        print("Програма завершена.")
        break
    # Виведення повідомлення про некоректну дату та повторення введення
    else:
        print("Введена дата не є коректною. Спробуйте ще раз.")
