"""
Дано два текстові файли: в першому записані в рядках назви мов програмування,
а у іншому на відповідних рядках - рейтинги цих мов у відсотках.
Напишіть програму для об’єднання кожного рядка з першого файлу з
відповідним рядком у другому файлі. Об’єднані рядки необхідно вивести на екран і,
водночас, в такому вигляді як у вихідних даних, записати у третій текстовий файл.

Вхідні дані:
input.txt
rating.txt

Вихідні дані:
output.txt
Python 10.9
Ruby 2.9
C++ 6.5
C 1.6
Java 17.8
GO 1.8

||| Курс Бритвич Олександр Володимирович (ПІБ)
"""
# Відкриття файлів для читання: 'input.txt' та 'rating.txt'
with open('input.txt', 'r') as input_file, open('rating.txt', 'r') as rating_file:
    # Читання даних з файлів та розділення рядків
    languages = input_file.read().splitlines()
    ratings = rating_file.read().splitlines()

# Перевірка, чи кількість рядків у файлах співпадає
if len(languages) != len(ratings):
    # Виведення помилки, якщо кількість рядків не співпадає
    print("Помилка: кількість рядків у файлах не співпадає.")
else:
    # Відкриття файлу для запису об'єднаних даних: 'output.txt'
    with open('output.txt', 'w') as output_file:
        # Виведення об'єднаних даних на екран та запис у файл
        for language, rating in zip(languages, ratings):
            combined_data = f"{language} {rating}"
            # Виведення на екран об'єднаних даних
            print(combined_data)
            # Запис об'єднаних даних у файл з новим рядком
            output_file.write(combined_data + '\n')
